Конфигурация/Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначенныеРоли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВидыДоговоровИСчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ДоступныеСчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеСчетаДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ГруппыПользователей/Ext/ObjectModule.bsl
Перем СтарыйРодитель;

////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ ПРОЦЕДУРЫ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Ссылка = Справочники.ГруппыПользователей.ВсеПользователи Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Организация"));
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		// дозаполним сопутствующие реквизиты
		ЭтотОбъект.Пользователи = "";
		
		Для каждого СтрокаСостав Из ЭтотОбъект.Состав Цикл
			
			ИмяПользователя = СокрЛП(СтрокаСостав.Пользователь);
			
			Если Найти(ИмяПользователя, " ") > 0 Тогда
				ИмяПользователя = Лев(ИмяПользователя, Найти(ИмяПользователя, " ") - 1);
			КонецЕсли;
			
			ЭтотОбъект.Пользователи = ЭтотОбъект.Пользователи + ?(ПустаяСтрока(ЭтотОбъект.Пользователи), "", ", ") + ИмяПользователя;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЭтоНовый()
		И Организация <> Ссылка.Организация
		И (Ссылка.Состав.Количество() > 0
			ИЛИ Ссылка.ДоступныеВидыДоговоровИСчетаДоверительногоУправления.Количество()) > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено менять организацию, если заполнены состав пользователей или доступные виды договоров!", ЭтотОбъект, "Организация", Отказ);
		Возврат;
	КонецЕсли;
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
		
		Если ЭтотОбъект.Родитель = Справочники.ГруппыПользователей.ВсеПользователи Тогда
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В предопределенной группе ""Все пользователи"" организация не может быть заполнена!'"), ЭтотОбъект, "Организация",, Отказ);
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Предопределенная группа ""Все пользователи"" не может быть родителем!'"), ЭтотОбъект, "Родитель",, Отказ);

			Если Не ЭтотОбъект.Родитель.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Предопределенная группа ""Все пользователи"" не может быть включена в состав другой группы!'"),,,, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.Состав.Количество() > 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Добавление пользователей в группу ""Все пользователи"" не поддерживается.'"),,,, Отказ);
			КонецЕсли;
			
		Иначе
			
			Если ЭтотОбъект.Родитель = Справочники.ГруппыПользователей.ВсеПользователи Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Предопределенная группа ""Все пользователи"" не может быть родителем!'"),,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверка повторяющихся пользователей
		НомерСтроки = ЭтотОбъект.Состав.Количество() - 1;
		
		Пока НЕ Отказ И НомерСтроки >= 0 Цикл
			ТекущаяСтрока = ЭтотОбъект.Состав.Получить(НомерСтроки);
			
			НайденныеЗначения = ЭтотОбъект.Состав.НайтиСтроки(Новый Структура("Пользователь", ТекущаяСтрока.Пользователь));
			Если НайденныеЗначения.Количество() > 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Пользователь повторяется!'"), ЭтотОбъект, "Состав[" + Формат(НомерСтроки, "ЧГ=0") + "].Пользователь",, Отказ);
				Возврат;
			КонецЕсли;
				
			НомерСтроки = НомерСтроки - 1;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭтотОбъект.Ссылка <> Справочники.ГруппыПользователей.ВсеПользователи Тогда
		СтарыйРодитель = ?(ЭтотОбъект.Ссылка.Пустая(), Неопределено, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "Родитель"));
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И РаботаСПользователями.ПоОрганизацииВключенКонтрольДоступаКСчетамДоверительногоУправления(Организация) Тогда
		ДополнительныеСвойства.Вставить("СозданаНоваяГруппа",		ЭтоНовый());
		ДополнительныеСвойства.Вставить("ИзмененСостав",			НЕ ПометкаУдаления И НЕ РаботаСКоллекциями.СпискиЗначенийИдентичны(Состав.ВыгрузитьКолонку("Пользователь"), Ссылка.Состав.ВыгрузитьКолонку("Пользователь")));
		ДополнительныеСвойства.Вставить("ИзмененаДоступность",		НЕ ПометкаУдаления И НЕ РаботаСКоллекциями.СпискиЗначенийИдентичны(ДоступныеВидыДоговоровИСчетаДоверительногоУправления.ВыгрузитьКолонку("Объект"), Ссылка.ДоступныеВидыДоговоровИСчетаДоверительногоУправления.ВыгрузитьКолонку("Объект")));
		ДополнительныеСвойства.Вставить("ИзмененаПометкаУдаления",	ПометкаУдаления <> Ссылка.ПометкаУдаления);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСПользователями.ОбновитьСоставГруппПользователей(ЭтотОбъект.Ссылка);
		
	Если ЗначениеЗаполнено(СтарыйРодитель) И СтарыйРодитель <> ЭтотОбъект.Родитель Тогда
		РаботаСПользователями.ОбновитьСоставГруппПользователей(СтарыйРодитель);
	КонецЕсли;
	
	// Если создали новую группу или сняли пометку удаления - просто добавляем данные о доступности.
	Если ДополнительныеСвойства.Свойство("СозданаНоваяГруппа") И ДополнительныеСвойства.СозданаНоваяГруппа
		ИЛИ ДополнительныеСвойства.Свойство("ИзмененаПометкаУдаления") И ДополнительныеСвойства.ИзмененаПометкаУдаления И НЕ ПометкаУдаления Тогда
		
		Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.ДобавитьДанныеОДоступностиСчетовДоверительногоУправления(Организация, Ссылка) Тогда
			ТекстСообщения = СтрШаблон("Не удалось записать группу доступа из-за ошибки при установке доступности счетов доверительного управления по организации '%1'!", Организация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	// Если изменили в существующей группе состав, доступность или установили пометку удаления - пересчитываем доступ по организации.
	ИначеЕсли ДополнительныеСвойства.Свойство("ИзмененСостав") И ДополнительныеСвойства.ИзмененСостав
		ИЛИ ДополнительныеСвойства.Свойство("ИзмененаДоступность") И ДополнительныеСвойства.ИзмененаДоступность
		ИЛИ ДополнительныеСвойства.Свойство("ИзмененаПометкаУдаления") И ДополнительныеСвойства.ИзмененаПометкаУдаления И ПометкаУдаления Тогда
		
		Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.ОбновитьДанныеОДоступностиСчетовДоверительногоУправленияПоОрганизации(Организация) Тогда
			ТекстСообщения = СтрШаблон("Не удалось записать группу доступа из-за ошибки при обновлении доступности счетов доверительного управления по организации '%1'!", Организация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
